# Number Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..Number Property
MEPSection Class See Also
---
The Section number.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int Number { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Number As Integer
	Get
```

Visual C++
---
```text
public:
property int Number {
	int get ();
}
```

# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace